Revit 2026 API

# KeynoteFailures Properties

---

The BuiltInFailuresKeynoteFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MissKeynoteParameter | No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system. |
|  | MissKeynotingSystem | No Keynoting System associated with Tag Family.\nTo resolve, select keynoting system for the tag family. |
|  | NotAssociatedKeynoteParameter | Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve, associate parameter with category or change keynoting system. |

#### Reference

BuiltInFailuresKeynoteFailures Class

Autodesk.Revit.DB Namespace